wiki/mantenimiento/README.md
```mermaid
sequenceDiagram
    participant Client
    participant Backend
    participant Database

    Client ->> Backend: /login: username, password
    Backend ->> Database: Query username

    Database -->> Backend: Hashed password
    Backend ->> Database: Session token

    Database -->> Backend: Date of generation
    Backend -->> Client: session token
```
